nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/inc/system/fmac_api.h
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/** @file
 *
 * @addtogroup nrf_wifi_api FMAC API
 * @{
 *
 * @brief Header containing API declarations for the
 * FMAC IF Layer of the Wi-Fi driver.
 */

#ifndef __FMAC_API_H__
#define __FMAC_API_H__

#include "osal_api.h"

#include <nrf71_wifi_ctrl.h>


#include "system/fmac_structs.h"
#include "system/fmac_cmd.h"
#include "system/fmac_event.h"
#include "system/fmac_vif.h"
#include "common/fmac_api_common.h"



/**
 * @brief Initialize the UMAC IF layer in the system mode of operation.
 *
 * @param data_config Pointer to configuration of data queues.
 * @param rx_buf_pools Pointer to configuration of Rx queue buffers.
 *		       See rx_buf_pool_params
 * @param callbk_fns Pointer to callback functions for addressing events
 *                   from the UMAC layer. e.g. callback function to process
 *                   packet received from RPU firmware, scan result etc
 *
 * This function initializes the UMAC IF layer. It does the following:
 *	    - Creates and initializes the context for the UMAC IF layer.
 *	    - Initializes the HAL layer.
 *	    - Initializes the OS abstraction Layer.
 *	    - Initializes TX queue token sizes.
 *	    - Initializes the RX buffer pool.
 *
 * @return Pointer to the context of the UMAC IF layer.
 */
struct nrf_wifi_fmac_priv *nrf_wifi_sys_fmac_init(struct nrf_wifi_data_config_params *data_config,
						  struct rx_buf_pool_params *rx_buf_pools,
						  struct nrf_wifi_fmac_callbk_fns *callbk_fns);

/**
 * @brief Issue a scan request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the scan is to be performed.
 * @param scan_info The parameters needed by the RPU for scan operation.
 *
 * This function is used to send a command to:
 *	    Instruct the RPU firmware to trigger a scan. The scan can be performed in two
 *	    modes:
 *
 *	    Auto Mode (%AUTO_SCAN):
 *             In this mode, the host does not need to specify any scan specific
 *          parameters. The RPU firmware will perform the scan on all the channels
 *          permitted by and abiding by the regulations imposed by the
 *          WORLD (common denominator of all regulatory domains) regulatory domain.
 *          The scan will be performed using the wildcard SSID.
 *
 *	    Channel Map Mode (%CHANNEL_MAPPING_SCAN):
 *             In this mode the host can have fine grained control over the scan
 *          specific parameters to be used (for example, Passive/Active scan selection,
 *          Number of probe requests per active scan, Channel list to scan,
 *          Permanence on each channel, SSIDs to scan etc.). This mode expects
 *          the regulatory restrictions to be taken care by the invoker of the
 *          API.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_scan(void *fmac_dev_ctx,
					unsigned char if_idx,
					struct nrf_wifi_umac_scan_info *scan_info);


/**
 * @brief Issue a scan results request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the scan results are to be fetched.
 * @param scan_type The scan type (i.e. DISPLAY or CONNECT scan).
 *
 * This function is used to send a command to:
 *	- Instruct the RPU firmware to return the results of a scan.
 *	- scan_type defines if the scan is performed for a
 *	  connection request (SCAN_CONNECT) or to display the
 *	  scan results to user (SCAN_DISPLAY)
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_scan_res_get(void *fmac_dev_ctx,
						unsigned char if_idx,
						int scan_type);

/**
 * @brief Issue abort of an ongoing scan to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the ongoing scan is to be aborted.
 *
 * This function is used to send a command to:
 *	- Instruct the RPU firmware to abort an ongoing scan request
 *	- The \p if_idx provides the interface index on which the ongoing scan is
 *	  to be aborted
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_abort_scan(void *fmac_dev_ctx,
						unsigned char if_idx);

#if defined(NRF71_STA_MODE) || defined(__DOXYGEN__)
/**
 * @brief Issue an 802.11 authentication request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the authentication is to be
 *	         performed.
 * @param auth_info The parameters needed by the RPU firmware to generate
 *                  the authentication request.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to initiate an authentication
 *	      request to an AP on the interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_auth(void *fmac_dev_ctx,
					unsigned char if_idx,
					struct nrf_wifi_umac_auth_info *auth_info);


/**
 * @brief Issue an 802.11 de-authentication request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the de-authentication is to be
 *          performed.
 * @param deauth_info De-authentication specific information required by the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to initiate a de-authentication notification to an AP
 *	      on the interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_deauth(void *fmac_dev_ctx,
					  unsigned char if_idx,
					  struct nrf_wifi_umac_disconn_info *deauth_info);


/**
 * @brief Issue an 802.11 association request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the association is to be
 *           performed.
 * @param assoc_info The parameters needed by the RPU firmware to generate the association
 *           request.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to initiate a association request to an AP on the
 *	      interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_assoc(void *fmac_dev_ctx,
					 unsigned char if_idx,
					 struct nrf_wifi_umac_assoc_info *assoc_info);


/**
 * @brief Issue an 802.11 disassociation request to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the disassociation is to be
 *	         performed.
 * @param disassoc_info Disassociation specific information required by the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to initiate a disassociation notification to an AP
 *	      on the interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_disassoc(void *fmac_dev_ctx,
					    unsigned char if_idx,
					    struct nrf_wifi_umac_disconn_info *disassoc_info);


/**
 * @brief Add an 802.11 security key into the RPU security database.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the key is to be added.
 * @param key_info Key specific information which needs to be passed to the RPU firmware.
 * @param mac_addr MAC address of the peer with which the key is associated.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to add a key to its security database.
 *	      The key is for the peer identified by \p mac_addr on the
 *	      interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_add_key(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_key_info *key_info,
					   const char *mac_addr);


/**
 * @brief Delete an 802.11 key from the RPU security database.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface for which the key is to be deleted.
 * @param key_info Key specific information which needs to be passed to the RPU firmware.
 * @param mac_addr MAC address of the peer with which the key is associated.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to delete a key from its security database.
 *	    - The key is for the peer identified by \p mac_addr on the
 *	      interface identified with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_del_key(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_key_info *key_info,
					   const char *mac_addr);


/**
 * @brief Set a key as a default for data or management
 *	  traffic in the RPU security database.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the key is to be set.
 * @param key_info Key specific information which needs to be passed to the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to set a key as a default key in its security database.
 *	    - The key is either for data or management traffic and is classified based on
 *	      the flags element set in \p key_info parameter.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_key(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_key_info *key_info);


/**
 * @brief Set BSS parameters for an AP mode interface in the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the BSS parameters are to be set.
 * @param bss_info BSS specific parameters which need to be passed to the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to set the BSS parameter for an AP mode interface.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_bss(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_bss_info *bss_info);


/**
 * @brief Update the Beacon Template.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the Beacon Template is to be updated.
 * @param data Beacon Template which need to be passed to the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to update beacon template for an AP mode interface.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_chg_bcn(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_set_beacon_info *data);

/**
 * @brief Start a SoftAP.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the SoftAP is to be started.
 * @param ap_info AP operation specific parameters which need to be passed to the RPU firmware.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to start a SoftAP on an interface identified with
 *	      \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_start_ap(void *fmac_dev_ctx,
					    unsigned char if_idx,
					    struct nrf_wifi_umac_start_ap_info *ap_info);


/**
 * @brief Stop a SoftAP.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the SoftAP is to be stopped.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to stop a SoftAP on an interface identified with
 *	      \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_stop_ap(void *fmac_dev_ctx,
					   unsigned char if_idx);


/**
 * @brief Start P2P mode on an interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the P2P mode is to be started.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to start P2P mode on an interface identified with
 *            \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_p2p_dev_start(void *fmac_dev_ctx,
						 unsigned char if_idx);


/**
 * @brief Start P2P mode on an interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the P2P mode is to be started.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to start P2P mode on an interface identified with
 *	     \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_p2p_dev_stop(void *fmac_dev_ctx,
						unsigned char if_idx);

/**
 * @brief Start p2p remain on channel.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface to be kept on channel and stay there.
 * @param roc_info Contains channel and time in ms to stay on.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to put p2p device in
 *	      listen state for a duration.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_p2p_roc_start(void *fmac_dev_ctx,
						 unsigned char if_idx,
						 struct remain_on_channel_info *roc_info);

/**
 * @brief Stop p2p remain on channel.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface to be kept on channel and stay there.
 * @param cookie cancel p2p listen state of the matching cookie.
 *
 * This function is used to send a command to:
 *          - Instruct the RPU firmware to put p2p device out
 *	      of listen state.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_p2p_roc_stop(void *fmac_dev_ctx,
						unsigned char if_idx,
						unsigned long long cookie);

/**
 * @brief Transmit a management frame.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the frame is to be
 *               transmitted.
 * @param mgmt_tx_info Information regarding the management frame to be
 *                     transmitted.
 *
 * This function is used to send a command to:
 *          - Instruct the RPU firmware to transmit a management frame.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_mgmt_tx(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_mgmt_tx_info *mgmt_tx_info);


/**
 * @brief Remove a station.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the STA is connected.
 * @param del_sta_info Information regarding the station to be removed.
 *
 * This function is used to send a command to:
 *          - Instruct the RPU firmware to remove a station entry and send a
 *	      de-authentication/disassociation frame to the station.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_del_sta(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_del_sta_info *del_sta_info);


/**
 * @brief Indicate a new STA connection to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the STA is connected.
 * @param add_sta_info Information regarding the new station.
 *
 * This function is used to indicate to the RPU firmware that a new STA has
 *	    successfully connected to the AP.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_add_sta(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_add_sta_info *add_sta_info);

/**
 * @brief Indicate changes to STA connection parameters to the RPU firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the STA is connected.
 * @param chg_sta_info Information regarding updates to the station parameters.
 *
 * This function is used to indicate changes in the connected STA parameters
 *	    to the RPU firmware.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_chg_sta(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_chg_sta_info *chg_sta_info);



/**
 * @brief Register the mgmt frame type which needs to be sent up to the host by the RPU firmware.
 *
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface from which the received frame is to be
 *               sent up.
 * @param frame_info Information regarding the management frame to be sent up.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to pass frames matching that type/subtype to be
 *	    passed up to the host driver.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_mgmt_frame_reg(void *fmac_dev_ctx,
						  unsigned char if_idx,
						  struct nrf_wifi_umac_mgmt_frame_info *frame_info);

#endif /* NRF71_STA_MODE */
/**
 * @brief Get unused MAC address from base mac address.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param addr Memory to copy the mac address to.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_mac_addr(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
					    unsigned char *addr);


/**
 * @brief Add a new virtual interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param os_vif_ctx Pointer to VIF context that the UMAC IF passes
 *                   up the stack during invocation of callback functions like
 *                   rx_frm_callbk_fn() etc.
 * @param vif_info Information regarding the interface to be added.
 *
 * This function is used to send a command to:
 *	    - Instruct the RPU firmware to add a new interface with parameters specified by
 *             \p vif_info.
 *
 * @return Index (maintained by the UMAC IF layer) of the VIF that was added.
 *         In case of error MAX_NUM_VIFS will be returned.
 */
unsigned char nrf_wifi_sys_fmac_add_vif(void *fmac_dev_ctx,
				    void *os_vif_ctx,
				    struct nrf_wifi_umac_add_vif_info *vif_info);


/**
 * @brief Deletes a virtual interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface to be deleted.
 *
 * This function is used to send a command to:
 *     - Instruct the RPU firmware to delete an interface which was added using
 *       \p nrf_wifi_sys_fmac_add_vif.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_del_vif(void *fmac_dev_ctx,
					   unsigned char if_idx);

/**
 * @brief Change the attributes of an interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the functionality is to be
 *               bound.
 * @param vif_info Interface specific information which needs to be passed to the
 *                 RPU firmware.
 *
 * This function is used to change the attributes of an interface identified
 *     with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_chg_vif(void *fmac_dev_ctx,
					   unsigned char if_idx,
					   struct nrf_wifi_umac_chg_vif_attr_info *vif_info);


/**
 * @brief Change the state of a virtual interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface whose state needs to be changed.
 * @param vif_info State information to be changed for the interface.
 *
 * This function is used to send a command to:
 *     - Instruct the RPU firmware to change the state of an interface identified by an index
 *       \p if_idx and parameters specified by \p vif_info.
 *     - The different states that can be configured are
 *         - NRF_WIFI_FMAC_IF_OP_STATE_DOWN
 *         - NRF_WIFI_FMAC_IF_OP_STATE_UP
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_chg_vif_state(void *fmac_dev_ctx,
						 unsigned char if_idx,
						 struct nrf_wifi_umac_chg_vif_state_info *vif_info);


/**
 * @brief Set MAC address on interface.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface whose MAC address is to be changed.
 * @param mac_addr MAC address to set.
 *
 * This function is used to set the MAC address of an interface identified
 *	    with \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_vif_macaddr(void *fmac_dev_ctx,
						   unsigned char if_idx,
						   unsigned char *mac_addr);

