nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/inc/system/fmac_api.h
/**
 * @brief Transmit a frame to the RPU.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the frame is to be
 *               transmitted.
 * @param netbuf Pointer to the OS specific network buffer.
 *
 * This function takes care of transmitting a frame to the RPU firmware.
 * It does the following:
 *
 *	- Queues the frames to a transmit queue.
 *	- Based on token availability, sends one or more frames to the RPU using
 *	  the command for transmission.
 *	- The firmware sends an event once the command has
 *	  been processed to indicate whether the frame(s) have been
 *	  transmitted/aborted.
 *	- The driver can cleanup the frame buffers after receiving this event.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_fmac_start_xmit(void *fmac_dev_ctx,
					      unsigned char if_idx,
					      void *netbuf);

/**
 * @brief Inform the RPU firmware that host is going to suspend state.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 *
 * This function is used to send a command to:
 *	    - Inform the RPU firmware that host is going to suspend state.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_fmac_suspend(void *fmac_dev_ctx);


/**
 * @brief Notify RPU firmware that host has resumed from a suspended state.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 *
 * This function is used to send a command to:
 *	    - Inform the RPU firmware that host has resumed from a suspended state.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_fmac_resume(void *fmac_dev_ctx);


/**
 * @brief Get tx power
 *
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx VIF index.
 *
 * This function is used to send a command to:
 *	    - Get the transmit power on a particular interface given
 *	      by \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_tx_power(void *fmac_dev_ctx,
						unsigned int if_idx);

/**
 * @brief Get channel definition.
 *
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx VIF index.
 *
 * This function is used to send a command to:
 *	    - Get the channel configured on a particular interface given by /p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_channel(void *fmac_dev_ctx,
					       unsigned int if_idx);

/**
 * @brief Get station statistics
 *
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx: VIF index.
 * @param mac MAC address of the station.
 *
 * This function is used to send a command to:
 *	    - Get station statistics using a MAC address.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_station(void *fmac_dev_ctx,
					       unsigned int if_idx,
					       unsigned char *mac);


/* @brief Get interface statistics
 *
 * @param dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx VIF index.
 *
 * This function is used to send a command to:
 *	    - Get interface statistics using interface index \p if_idx.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_interface(void *dev_ctx,
					       unsigned int if_idx);


/**
 * @brief Configure WLAN power management.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param state Enable/Disable of WLAN power management.
 *
 * This function is used to send a command to:
 *	     - The RPU firmware to Enable/Disable WLAN Power management.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_power_save(void *fmac_dev_ctx,
						  unsigned char if_idx,
						  bool state);

/**
 * @brief Configure WLAN U-APSD queue.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param uapsd_queue Queue to be set for U-APSD.
 *
 * This function is used to send a command (%NRF_WIFI_UMAC_CMD_CONFIG_UAPSD) to:
 *	    - The RPU firmware to set a U-APSD queue value.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_uapsd_queue(void *fmac_dev_ctx,
						   unsigned char if_idx,
						   unsigned int uapsd_queue);

/**
 * @brief Configure Power save timeout.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param ps_timeout Power save inactivity time.
 *
 * This function is used to send a command (%NRF_WIFI_UMAC_CMD_SET_POWER_SAVE_TIMEOUT) to:
 *          - The RPU firmware to set power save inactivity time.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_power_save_timeout(void *fmac_dev_ctx,
							  unsigned char if_idx,
							  int ps_timeout);

/**
 * @brief Configure qos_map of for data
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the qos map be set.
 * @param qos_info qos_map information.
 *
 * This function is used to send a command to:
 *	    - The RPU firmware to set QOS map information.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_qos_map(void *fmac_dev_ctx,
					       unsigned char if_idx,
					       struct nrf_wifi_umac_qos_map_info *qos_info);

/**
 * @brief Configure WoWLAN.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param var Wakeup trigger condition.
 *
 * This function is used to send a command to the RPU firmware to:
 *	    - Configure wakeup trigger condition in RPU.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_fmac_set_wowlan(void *fmac_dev_ctx,
					      unsigned int var);

/**
 * @brief Get PHY configuration.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the CMD needs to be sent.
 *
 * This function is used to get PHY configuration from the RPU firmware.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_wiphy(void *fmac_dev_ctx, unsigned char if_idx);

/**
 * @brief Register to get MGMT frames.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the CMD needs to be sent.
 * @param frame_info Information regarding the management frame.
 *
 * Register with the RPU firmware to receive specific MGMT frames from the RPU to the host side.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_register_frame(void *fmac_dev_ctx, unsigned char if_idx,
						  struct nrf_wifi_umac_mgmt_frame_info *frame_info);

/**
 * @brief Set wiphy parameters
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the CMD needs to be sent.
 * @param wiphy_info wiphy parameters
 *
 * This function is used to send a command to the RPU firmware to:
 *	    - Configure parameters interface specific parameters on an interface identified
 *	      by \p if_idx
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */

