nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/inc/system/fmac_api.h
enum nrf_wifi_status nrf_wifi_sys_fmac_set_wiphy_params(void *fmac_dev_ctx,
						 unsigned char if_idx,
						 struct nrf_wifi_umac_set_wiphy_info *wiphy_info);

/**
 * @brief TWT setup command
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the TWT parameters be set.
 * @param twt_info TWT parameters.
 *
 * This function is used to send a command to the RPU firmware to:
 *	    - Configure TWT setup specific parameters.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_twt_setup(void *fmac_dev_ctx,
					     unsigned char if_idx,
					     struct nrf_wifi_umac_config_twt_info *twt_info);

/**
 * @brief TWT teardown command
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the TWT parameters are to be set.
 * @param twt_info TWT parameters.
 *
 * This function is used to send a command to the RPU firmware to:
 *	    - Tear down an existing TWT session.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_twt_teardown(void *fmac_dev_ctx,
						unsigned char if_idx,
						struct nrf_wifi_umac_config_twt_info *twt_info);

/**
 * @brief Get connection info from RPU
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface.
 *
 * This function is used to send a command to the RPU firmware to:
 *	    - Fetch connection information.
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_conn_info(void *fmac_dev_ctx,
						unsigned char if_idx);

/**
 * @brief Adds a RPU instance.
 * @param fpriv Pointer to the context of the UMAC IF layer.
 * @param os_dev_ctx Pointer to the OS specific context of the RPU instance.
 *
 * This function adds an RPU instance. This function will return the
 *	    pointer to the context of the RPU instance. This pointer will need to be
 *	    supplied while invoking further device specific APIs,
 *	    for example, nrf_wifi_sys_fmac_scan() etc.
 *
 * @return Pointer to the context of the RPU instance.
 */
struct nrf_wifi_fmac_dev_ctx *nrf_wifi_sys_fmac_dev_add(struct nrf_wifi_fmac_priv *fpriv,
							void *os_dev_ctx);


/**
 * @brief Initialize an RPU instance.
 * @param fmac_dev_ctx Pointer to the context of the RPU instance to be removed.
 * @param sleep_type Type of RPU sleep.
 * @param phy_calib PHY calibration flags to be passed to the RPU.
 * @param op_band Operating band of the RPU.
 * @param beamforming Enable/disable Wi-Fi beamforming.
 * @param tx_pwr_ctrl_params TX power control parameters to be passed to the RPU.
 * @param tx_pwr_ceil_params TX power ceil parameters for both frequency bands.
 * @param board_params Board parameters to be passed to the RPU.
 * @param country_code Country code to be set for regularity domain.
 *
 * This function initializes the firmware of an RPU instance. The following is addressed
 *              - BAL layer device initialization
 *              - HAL layer device initialization
 *              - FW initialization and PHY calibration data is sent to PHY
 *              - RX and TX buffers are initialized, tasklets assigned
 *
 * @retval	NRF_WIFI_STATUS_SUCCESS On success
 * @retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_dev_init(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
#if defined(NRF_WIFI_LOW_POWER) || defined(__DOXYGEN__)
					    int sleep_type,
#endif /* NRF_WIFI_LOW_POWER */
					    unsigned int phy_calib,
					    unsigned char op_band,
					    bool beamforming,
					    struct nrf_wifi_tx_pwr_ctrl_params *tx_pwr_ctrl_params,
					    struct nrf_wifi_tx_pwr_ceil_params *tx_pwr_ceil_params,
					    struct nrf_wifi_board_params *board_params,
					    unsigned char *country_code);


/**
 * @brief De-initialize a RPU instance.
 * @param fmac_dev_ctx Pointer to the context of the RPU instance to be removed.
 *
 * This function de-initializes the firmware of an RPU instance.
 *		- RPU UMAC deinitialization command is executed
 *		- RX and TX is deallocated for firmware via UMAC command
 */
void nrf_wifi_sys_fmac_dev_deinit(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx);

#ifdef NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL
/**
 * @brief Configure Sleep control GPIO control for coexistence.
 * @param fmac_dev_ctx Pointer to the context of the RPU instance.
 * @param alt_swctrl1_function_bt_coex_status1 SWCTRL1 alternative function selection.
 * @param invert_bt_coex_grant_output BT coexistence grant polarity selection.
 *
 * This function configures the GPIO control register fields for coex.
 *		- Configures the SWCTRL1 alternative function selection
 *		- Configures BT coexistence grant polarity selection
 * @retval	NRF_WIFI_STATUS_SUCCESS On success
 * @retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_coex_config_sleep_ctrl_gpio_ctrl(
		struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
		unsigned int alt_swctrl1_function_bt_coex_status1,
		unsigned int invert_bt_coex_grant_output);
#endif /* NRF71_SR_COEX_SLEEP_CTRL_GPIO_CTRL */

/**
 * @brief Configure WLAN listen interval.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param listen_interval listen interval to be configured.
 *
 * This function is used to send a command to RPU to configure listen interval.
 * Refer section 9.4.1.6 is 802.11-2020 standard for details on listen interval
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_listen_interval(void *fmac_dev_ctx,
							unsigned char if_idx,
							unsigned short listen_interval);

/**
 * @brief Configure WLAN PS wakeup mode to DTIM interval or listen interval.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param ps_wakeup_mode Enable listen interval based ps(default is DTIM based)
 *
 * This function is used to configure PS wakeup mode,  PS wakeup mode can be
 *         configured to:
 *            - DTIM interval based PS mode
 *            - Listen interval based PS mode
 *         Default mode is set to DTIM interval based PS mode
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_ps_wakeup_mode(void *fmac_dev_ctx,
							unsigned char if_idx,
							bool ps_wakeup_mode);

/**
 * @brief Configure power save exit strategy.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which power management is to be set.
 * @param ps_exit_strategy PS exit strategy to be configured in RPU.
 *
 * This function is used to send a command to RPU
 * to configure PS exit strategy in RPU.
 *
 * @return Command execution status
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_ps_exit_strategy(
						void *fmac_dev_ctx,
						unsigned char if_idx,
						unsigned int ps_exit_strategy);

#ifdef NRF71_RAW_DATA_TX
/**
 * @brief Transmit a raw unaltered frame to the RPU.
 * @param dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which the frame is to be
 *               transmitted.
 * @param net_packet Pointer to the OS specific network buffer.
 *
 * This function takes care of transmitting a frame to the RPU firmware.
 * It does the following:
 *
 *     - Queues the frames to a transmit queue.
 *     - Based on token availability, sends one or more frames to the RPU using
 *       the command for transmission.
 *     - The firmware sends an event once the command has
 *       been processed to indicate whether the frame has been
 *       transmitted/aborted.
 *     - The driver cleans up the frame buffer(s) after receiving this event.
 *
 *@retval      NRF_WIFI_STATUS_SUCCESS On success
 *@retval      NRF_WIFI_STATUS_FAIL On failure
 */
enum nrf_wifi_status nrf_wifi_fmac_start_rawpkt_xmit(void *dev_ctx,
						     unsigned char if_idx,
						     void *net_packet);
#endif /* NRF71_RAW_DATA_TX */

/**
 * @brief Check if a valid mode is being set.
 * @param mode The mode value attempted to be configured.
 *
 * This function checks the mode value attempted to be configured
 * is a valid mode as supported by the driver. If the mode is valid,
 * the mode will be configured to the lower layers, else an error value
 * will be flagged.
 *
 *@retval      NRF_WIFI_STATUS_SUCCESS On success
 *@retval      NRF_WIFI_STATUS_FAIL On failure
 */
enum nrf_wifi_status nrf_wifi_check_mode_validity(unsigned char mode);

#if defined(NRF_WIFI_RPU_RECOVERY) || defined(__DOXYGEN__)
/** @cond INTERNAL_HIDDEN */
enum nrf_wifi_status nrf_wifi_sys_fmac_rpu_recovery_callback(void *mac_dev_ctx,
						void *event_data,
						unsigned int len);
/** @endcond */
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */

#ifdef NRF71_SYSTEM_WITH_RAW_MODES
/**
 * @brief Set the current mode of operation
 * @param dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which mode is to be set.
 * @param mode Value to be set for the interface.
 *
 * This function is used to send a command
 *         to RPU to set mode of operation
 *
 * @retval      NRF_WIFI_STATUS_SUCCESS On success
 * @retval      NRF_WIFI_STATUS_FAIL On failure
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_mode(void *dev_ctx,
						unsigned char if_idx,
						unsigned char mode);
#endif

#if defined(NRF71_RAW_DATA_TX) || defined(NRF71_RAW_DATA_RX)
/**
 * @brief Set the current channel
 * @param dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param if_idx Index of the interface on which mode is to be set.
 * @param channel Value to be set for the interface.
 *
 * This function is used to send a command
 *         to RPU to set current channel of operation
 *
 * @retval      NRF_WIFI_STATUS_SUCCESS On success
 * @retval      NRF_WIFI_STATUS_FAIL On failure
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_channel(void *dev_ctx,
						   unsigned char if_idx,
						   unsigned int channel);

#endif /* NRF71_RAW_DATA_TX || NRF71_RAW_DATA_RX */

