nrfconnect/sdk-nrf/drivers/wifi/nrf71/osal/fw_if/umac_if/inc/system/fmac_api.h
#if defined(NRF71_RAW_DATA_RX) || defined(NRF71_PROMISC_DATA_RX)
/**
 * @brief Set packet filter settings
 * @param dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param filter Value to be set for the interface.
 * @param if_idx Index of the interface on which mode is to be set.
 * @param buffer_size Size of packet capture length.
 *
 * This function is used to send a command
 *         to RPU to set filter setting for sniffer operation
 *
 * @return Command execution status
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_set_packet_filter(void *dev_ctx,
							 unsigned char filter,
							 unsigned char if_idx,
							 unsigned short buffer_size);
#endif /* NRF71_RAW_DATA_RX || NRF71_PROMISC_DATA_RX */

#if defined(NRF71_UTIL) || defined(__DOXYGEN__)
enum nrf_wifi_status nrf_wifi_sys_fmac_set_tx_rate(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						   unsigned char rate_flag,
						   int data_rate);
#if defined(NRF_WIFI_LOW_POWER) || defined(__DOXYGEN__)
/**
 * @brief Get the RPU power save status from host perspective.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param rpu_ps_ctrl_state Pointer to the address where the current RPU power save state
 *			    from host perspective needs to be copied.
 *
 * This function is used to fetch the RPU power save status
 *	    from host perspective.
 *
 * @return Command execution status
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_get_host_rpu_ps_ctrl_state(void *fmac_dev_ctx,
								  int *rpu_ps_ctrl_state);
#endif /* NRF_WIFI_LOW_POWER */
#endif /* NRF71_UTIL */

/**
 * @brief Configure HE LTF and GI parameters.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param he_ltf HE LTF parameter which will be configured in RPU.
 * @param he_gi HE GI parameter which will be configured in RPU.
 * @param enabled enable/disable HE LTF and GI parameter configured.
 *
 * This function is used to send a command to RPU
 *	    to configure HE LTF and GI parameters in RPU.
 *
 * @return Command execution status
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_conf_ltf_gi(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						   unsigned char he_ltf,
						   unsigned char he_gi,
						   unsigned char enabled);


/**
 * @brief Issue a request to get stats from the RPU.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param stats_type Type of statistics to retrieve.
 * @param stats Pointer to memory where the stats are to be copied.
 *
 * This function is used to send a command to
 *	    instruct the firmware to return the current RPU statistics. The RPU will
 *	    send the event with the current statistics.
 *
 * @return Command execution status
 */
enum nrf_wifi_status nrf_wifi_sys_fmac_stats_get(struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx,
						 enum rpu_stats_type stats_type,
						 struct rpu_sys_op_stats *stats);
#ifdef NRF_WIFI_RX_BUFF_PROG_UMAC
/**
 * @brief Send  Rx buffer details to firmware.
 * @param fmac_dev_ctx Pointer to the UMAC IF context for a RPU WLAN device.
 * @param nrf_wifi_rx_buf RX buffer info.
 * @param num_buffs Number of buffers.
 *
 * This function is used to send host Rx buffers to UMAC module
 *
 *@retval	NRF_WIFI_STATUS_SUCCESS On success
 *@retval	NRF_WIFI_STATUS_FAIL On failure to execute command
 */
enum nrf_wifi_status nrf_wifi_fmac_prog_rx_buf_info(void *fmac_dev_ctx,
					       struct nrf_wifi_rx_buf *rx_buf,
					       unsigned int num_buffs);
#endif /*NRF_WIFI_RX_BUFF_PROG_UMAC*/

/**
 * @}
 */
#endif /* __FMAC_API_H__ */
